x1 = int(input("введите первую координату первой клетки (от 1 до 8) - "))
y1 = int(input("введите вторую координату первой клетки (от 1 до 8) - "))
x2 = int(input("введите первую координату второй клетки (от 1 до 8) - "))
y2 = int(input("введите вторую координату второй клетки (от 1 до 8) - "))
import math
if x1 == x2:
    a = "YES"
elif y1 == y2:
    a = "YES"
elif (abs(x1 - y1) == abs(x2 - y2)):
    a = "YES"
elif ((x1 + 1) >= x2 >= (x1 - 1))&((y1 + 1) >= y2 >= (y1 - 1)):
    a = "YES"
else:
    a = "NO"
print(a)
input()
